Revit 2027 API
RebarUpdateCurvesData.IsSpacingChanged Property
 Indicates if the spacing has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSpacingChanged { get; }
Public ReadOnly Property IsSpacingChanged As Boolean
	Get
public:
property bool IsSpacingChanged {
	bool get ();
}
member IsSpacingChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace